update docs 5/6/2026
